{
    "1" : {
        "BAB": "BAB I",
        "title": "BENTUK DAN KEDAULATAN",
        "pasal": [{
            "no": "1",
            "ayat": [
                "Negara Indonesia ialah Negara Kesatuan, yang berbentuk Republik.",
                "Kedaulatan berada di tangan rakyat dan dilaksanakan menurut Undang-Undang Dasar.***",
                "Negara Indonesia adalah negara hukum. ***"
            ]
        }]
    },
    "2" : {
        "BAB": "BAB II",
        "title": "MAJELIS PERMUSYAWARATAN RAKYAT",
        "pasal": [
            {
                "no": "2",
                "ayat": [
                    "Majelis Permusyawaratan Rakyat terdiri atas anggota Dewan Perwakilan Rakyat dan anggota Dewan Perwakilan Daerah yang dipilih melalui pemilihan umum dan diatur lebih lanjut dengan undangundang.****",
                    "Majelis Permusyawaratan Rakyat bersidang sedikitnya sekali dalam lima tahun di ibukota negara.",
                    "Segala putusan Majelis Permusyawaratan Rakyat ditetapkan dengan suara yang terbanyak."
                ]
            },
            {
                "no": "3",
                "ayat": [
                    "Majelis Permusyawaratan Rakyat berwenang mengubah dan menetapkan Undang Undang Dasar. ***",
                    "Majelis Permusyawaratan Rakyat melantik Presiden dan/atau Wakil Presiden. ***/****",
                    "Majelis Permus yawaratan Rakyat hanya dap at memberhentikan Presiden dan/atau Wakil Presiden dalam masa jabatannya menurut UndangUndang Dasar. ***/****"
                ]
            }
        ]
    },
    "3" : {
        "BAB": "BAB III",
        "title": "KEKUASAAN PEMERINTAH",
        "pasal": [
            {
                "no": "4",
                "ayat": [
                    "Presiden Republik Indonesia memegang kekuasaan pemerintahan menurut Undang Undang Dasar.",
                    "Dalam melakukan kewajibannya Presiden dibantu oleh satu orang Wakil Presiden."
                ]
            },
            {
                "no": "5",
                "ayat": [
                    "Presiden berhak mengajukan rancangan undangundang kepada Dewan Perwakilan Rakyat. *",
                    "Presiden menetapkan peraturan pemerintah untuk menjalankan undangundang sebagaimana mestinya."
                ]
            },
            {
                "no": "6",
                "ayat": [
                    "Calon Presiden dan calon Wakil Presiden harus seorang warga negara Indonesia sejak kelahirannya dan tidak pernah menerima kewarganegaraan lain karena kehendaknya sendiri, tidak pernah mengkhianati negara, serta mampu secara rohani dan jasmani untuk melaksanakan tugas dan kewajiban sebagai Presiden dan Wakil Presiden. **",
                    "Syarat syarat untuk menjadi Presiden dan Wakil Presiden diatur lebih lanjut dengan undangundang. ***"
                ]
            },
            {
                "no": "6A",
                "ayat": [
                    "Presiden dan Wakil Presiden dipilih dalam satu pasangan secara langsung oleh rakyat.***",
                    "Pasangan calon Presiden dan Wakil Presiden diusulkan oleh partai politik atau gabungan partai politik peserta pemilihan umum sebelum pelaksanaan pemilihan umum. ***",
                    "Pasangan calon Presiden dan Wakil Presiden yang mendapatkan suara lebih dari lima puluh persen dari jumlah suara dalam pemilihan umum dengan sedikitnya dua puluh persen suara di setiap provinsi yang tersebar di lebih dari setengah jumlah provinsi di Indonesia, dilantik menjadi Presiden dan Wakil Presiden. ***",
                    "Dalam hal tidak ada pasangan calon Presiden dan Wakil Presiden terpilih, dua pasangan calon yang memperoleh suara terbanyak pertama dan kedua dalam pemilihan umum dipilih oleh rakyat secara langsung dan pasangan yang memperoleh suara rakyat terbanyak dilantik sebagai Presiden dan Wakil Presiden. ****",
                    "Tata cara pelaksanaan pemilihan Presiden dan Wakil Presiden lebih lanjut diatur dalam undangundang. ***"
                ]
            },
            {
                "no": "7",
                "ayat": [
                    "Presiden dan Wakil Presiden memegang jabatan selama lima tahun, dan sesudahnya dapat dipilih kembali dalam jabatan yang sama, hanya untuk satu kali masa jabatan.*"
                ]
            },
            {
                "no": "7A",
                "ayat": [
                    "Presiden dan/atau Wakil Presiden dapat diberhentikan dalam masa jabatannya oleh Majelis Permusyawaratan Rakyat atas usul Dewan Perwakilan Rakyat, baik apabila terbukti telah melakukan pelanggaran hukum berupa pengkhianatan terhadap negara, korupsi, penyuapan, tindak pidana berat lainnya, atau perbuatan tercela maupun apabila terbukti tidak lagi memenuhi syarat sebagai Presiden dan/atau Wakil Presiden. ***"
                ]
            },
            {
                "no": "7B",
                "ayat": [
                    "Usul pemberhentian Presiden dan/atau Wakil Presiden dapat diajukan oleh Dewan Perwakilan Rakyat kepada Majelis Permusyawaratan Rakyat hanya dengan terlebih dahulu mengajukan permintaan kepada Mahkamah Konstitusi untuk memeriksa, mengadili, dan memutus pendapat Dewan Perwakilan Rakyat bahwa Presiden dan/atau Wakil Presiden telah melakukan pelanggaran hukum berupa pengkhianatan terhadap negara, korupsi, penyuapan, tindak pidana berat lainnya, atau perbuatan tercela; dan/atau pendapat bahwa Presiden dan/atau Wakil Presiden tidak lagi memenuhi syarat sebagai Presiden dan/atau Wakil Presiden. ***",
                    "Pendapat Dewan Perwakilan Rakyat bahwa Presiden dan/atau Wakil Presiden telah melakukan pelanggaran hukum tersebut ataupun telah tidak lagi memenuhi syarat sebagai Presiden dan/atau Wakil Presiden adalah dalam rangka pelaksanaan fungsi pengawasan Dewan Perwakilan Rakyat. ***",
                    "Pengajuan permintaan Dewan Perwakilan Rakyat kepada Mahkamah Konstitusi hanya dapat dilakukan dengan dukungan sekurangkurangnya 2/3 dari jumlah anggota Dewan Perwakilan Rakyat yang hadir dalam sidang paripurna yang dihadiri oleh sekurangkurangnya 2/3 dari jumlah anggota Dewan Perwakilan Rakyat. ***",
                    "Mahkamah Konstitusi wajib memeriksa, mengadili, dan memutus dengan seadiladilnya terhadap pendapat Dewan Perwakilan Rakyat tersebut paling lama sembilan puluh hari setelah permintaan Dewan Perwakilan Rakyat itu diterima oleh Mahkamah Konstitusi. ***",
                    "Apabila Mahkamah Konstitusi memutuskan bahwa Presiden dan/atau Wakil Presiden terbukti melakukan pelanggaran hukum berupa pengkhianatan terhadap negara, korupsi, penyuapan, tindak pidana berat lainnya, atau perbuatan tercela; dan/atau terbukti bahwa Presiden dan/atau Wakil Presiden tidak lagi memenuhi syarat sebagai Presiden dan/atau Wakil Presiden, Dewan Perwakilan Rakyat menyelenggarakan sidang paripurna untuk meneruskan usul pemberhentian Presiden dan/atau Wakil Presiden kepada Majelis Permusyawaratan Rakyat. ***",
                    "Majelis Permusyawaratan Rakyat wajib menyelenggarakan sidang untuk memutuskan usul Dewan Perwakilan Rakyat tersebut paling lambat tiga puluh hari sejak Majelis Permusyawaratan Rakyat menerima usul tersebut. ***",
                    "Keputusan Majelis Permusyawaratan Rakyat atas usul pemberhentian Presiden dan/atau Wakil Presiden harus diambil dalam rapat paripurna Majelis Permusyawaratan Rakyat yang dihadiri oleh sekurangkurangnya 3/4 dari jumlah anggota dan disetujui oleh sekurangkurangnya 2/3 dari jumlah anggota yang hadir, setelah Presiden dan/atau Wakil Presiden diberi kesempatan menyampaikan penjelasan dalam rapat paripurna Majelis Permusyawaratan Rakyat. ***"
                ]
            },
            {
                "no": "7C",
                "ayat": [
                    "Presiden tidak dapat membekukan dan/atau membubarkan Dewan Perwakilan Rakyat. ***"
                ]
            },
            {
                "no": "8",
                "ayat": [
                    "Jika Presiden mangkat, berhenti, diberhentikan, atau tidak dapat melakukan kewajibannya dalam masa jabatannya, ia digantikan oleh Wakil Presiden sampai habis masa jabatannya. ***",
                    "Dalam hal terjadi kekosongan Wakil Presiden, selambatlambatnya dalam waktu enam puluh hari, Majelis Permusyawaratan Rakyat menyelenggarakan sidang untuk memilih Wakil Presiden dari dua calon yang diusulkan oleh Presiden. ***",
                    "Jika Presiden dan Wakil Presiden mangkat, berhenti, diberhentikan, atau tidak dapat melakukan kewajibannya dalam masa jabatannya secara bersamaan, pelaksana tugas kepresidenan adalah Menteri Luar Negeri, Menteri Dalam Negeri, dan Menteri Pertahanan secara bersamasama. Selambatlambatnya tiga puluh hari setelah itu, Majelis Permusyawaratan Rakyat menyelenggarakan sidang untuk memilih Presiden dan Wakil Presiden dari dua pasangan calon Presiden dan Wakil Presiden yang diusulkan oleh partai politik atau gabungan partai politik yang pasangan calon Presiden dan Wakil Presidennya meraih suara terbanyak pertama dan kedua dalam pemilihan umum sebelumnya, sampai berakhir masa jabatannya. ****"
                ]
            },
            {
                "no": "9",
                "ayat": [
                    "J Sebelum memangku jabatannya, Presiden dan Wakil Presiden bersumpah menurut agama, atau berjanji dengan sungguhsungguh di hadapan Majelis Permusyawaratan Rakyat atau Dewan Perwakilan Rakyat sebagai berikut : Sumpah Presiden (Wakil Presiden) : Demi Allah, saya bersumpah akan memenuhi kewajiban Presiden Republik Indonesia (Wakil Presiden Republik Indonesia) dengan sebaikbaiknya dan seadiladilnya, memegang teguh UndangUndang Dasar dan menjalankan segala undangundang dan peraturannya dengan seluruslurusnya serta berbakti kepada Nusa dan Bangsa. Janji Presiden (Wakil Presiden) : Saya berjanji dengan sungguhsungguh akan memenuhi kewajiban Presiden Republik Indonesia (Wakil Presiden Republik Indonesia) dengan sebaikbaiknya dan seadiladilnya, memegang teguh UndangUndang Dasar dan menjalankan segala undangundang dan peraturannya dengan seluruslurusnya serta berbakti kepada Nusa dan Bangsa. *",
                    "Jika Majelis Permusyawaratan Rakyat atau Dewan Perwakilan Rakyat tidak dapat mengadakan sidang, Presiden dan Wakil Presiden bersumpah menurut agama, atau berjanji dengan sungguhsungguh di hadapan pimpinan Majelis Permusyawaratan Rakyat dengan disaksikan oleh Pimpinan Mahkamah Agung. *"
                ]
            },
            {
                "no": "10",
                "ayat": [
                    "Presiden memegang kekuasaan yang tertinggi atas Angkatan Darat, Angkatan Laut dan Angkatan Udara."
                ]
            },
            {
                "no": "11",
                "ayat": [
                    "Presiden dengan persetujuan Dewan Perwakilan Rakyat menyatakan perang, membuat perdamaian dan perjanjian dengan negara lain. ****",
                    "Presiden dalam membuat perjanjian internasional lainnya yang menimbulkan akibat yang luas dan mendasar bagi kehidupan rakyat yang terkait dengan beban keuangan negara, dan/atau mengharuskan perubahan atau pembentukan undangundang harus dengan persetujuan Dewan Perwakilan Rakyat. ***",
                    "Ketentuan lebih lanjut tentang perjanjian internasional diatur dengan undangundang. ***"
                ]
            },
            {
                "no": "12",
                "ayat": [
                    "Presiden menyatakan keadaan bahaya. Syaratsyarat dan akibatnya keadaan bahaya ditetapkan dengan undangundang."
                ]
            },
            {
                "no": "13",
                "ayat": [
                    "Presiden mengangkat duta dan konsul.",
                    "Dalam hal mengangkat duta, Presiden memperhatikan pertimbangan Dewan Perwakilan Rakyat. *",
                    "Presiden menerima penempatan duta negara lain dengan memperhatikan pertimbangan Dewan Perwakilan Rakyat. *"
                ]
            },
            {
                "no": "14",
                "ayat": [
                    "Presiden memberi grasi dan rehabilitasi dengan memperhatikan pertimbangan Mahkamah Agung. *",
                    "Presiden memberi amnesti dan abolisi dengan memperhatikan pertimbangan Dewan Perwakilan Rakyat. *"
                ]
            },
            {
                "no": "15",
                "ayat": [
                    "Presiden memberi gelar, tanda jasa, dan lainlain tanda kehormatan yang diatur dengan undangundang. *"
                ]
            },
            {
                "no": "16",
                "ayat": [
                    "Presiden membentuk suatu dewan pertimbangan yang bertugas memberikan nasihat dan pertimbangan kepada Presiden, yang selanjutnya diatur dalam undangundang. ****"
                ]
            }
        ]
    },
    "4" : {
        "BAB": "BAB IV",
        "title": "DEWAN PERTIMBANGAN AGUNG",
        "pasal": [
            {
                "no": "",
                "ayat": [
                    "Dihapus.****"
                ]
            }
        ]
    },
    "5" : {
        "BAB": "BAB V",
        "title": "KEMENTERIAN NEGARA",
        "pasal": [
            {
                "no": "17",
                "ayat": [
                    "Presiden dibantu oleh menteri-menteri negara.",
                    "Menteri-menteri itu diangkat dan diberhentikan oleh Presiden. *",
                    "Setiap menteri membidangi urusan tertentu dalam pemerintahan. *",
                    "Pembentukan, pengubahan, dan pembubaran kementerian negara diatur dalam undang-undang. ***"
                ]
            }
        ]
    }
}